Repository: kvnmtz/pokemate
Catalog: frontend/lib/l10n/app_*.arb
Languages: de

source: Type Calculator
de: Typenrechner

source: Team Builder
de: Team-Planer

source: Settings
de: Einstellungen

# searchPokemon
source: Search Pokémon
de: Pokémon suchen

source: First type
de: Erster Typ

source: Second type
de: Zweiter Typ

# typeNone
source: None
de: Keiner

# takesXDamageFrom
source: Takes {factor} damage from
de: Nimmt {factor} Schaden von

source: Load
de: Laden

source: Save
de: Speichern

source: Clear
de: Leeren

source: Delete
de: Löschen

source: Saved teams
de: Gespeicherte Teams

# noSavedTeams
source: No teams saved yet.
de: Bis jetzt wurden noch keine Teams gespeichert.

# giveTeamName
source: Give your team a name
de: Gib dem Team einen Namen

# overwriteTeamTitle
source: Overwrite team
de: Team überschreiben

# overwriteTeamDesc
source: A team with this name already exists. Do you want to overwrite it?
de: Es existiert bereits ein Team mit diesem Namen. Möchtest du es überschreiben?

source: Yes
de: Ja

source: No
de: Nein

source: Cancel
de: Abbrechen

source: Remove
de: Entfernen

source: Submit
de: Bestätigen

source: Species
de: Spezies

# attackNoX
source: Move #{number}
de: Attacke #{number}

source: Weaknesses
de: Schwächen

# weaknessesNone
source: (None)
de: (Keine)

source: Offensive coverage
de: Offensive Abdeckung

# teamHitsXSuperEffectively
source: This team can hit {covered} / {total} Pokémon super-effectively (including alternative forms).
de: Dieses Team kann {covered} / {total} Pokémon sehr effektiv treffen (inklusive alternativer Formen).

# teamCantHitAnything
source: This team can't hit any Pokémon super-effectively.
de: Dieses Team kann keine Pokémon sehr effektiv treffen.

# notCoveredPokemon
source: Pokémon that cannot be hit super-effectively:
de: Pokémon, die nicht sehr effektiv getroffen werden können:

# darkTheme
source: Dark Mode
de: Dunkles Design

source: Language
de: Sprache

source: Multi-Language-Search
de: Multi-Sprach-Suche

# multiLanguageSearchDesc
source: Search function includes results from all languages
de: Suchfunktion bezieht Ergebnisse aus allen Sprachen ein

source: Logout
de: Abmelden

source: Login
de: Anmelden

source: Register
de: Registrieren

source: Register new account
de: Neuen Account registrieren

source: Username
de: Nutzername

source: Password
de: Passwort

# initializationErrorDescriptionWeb
source: Error while loading data. An active internet connection is required.
de: Fehler während des Ladevorgangs. Es wird eine aktive Internetverbindung benötigt.

# initializationErrorDescription
source: Error while loading data. The initialization process requires an internet connection once.
de: Fehler während des Ladevorgangs. Zur Initialisierung wird beim ersten Start eine Internetverbindung benötigt.

source: Try again
de: Nochmal versuchen

# successLogout
source: Logout successful.
de: Abmeldung erfolgreich.

# errorNoPokemon
source: You need at least one Pokémon in your team.
de: Du brauchst mindestens ein Pokémon in deinem Team.

# errorNoSpecies
source: Please provide a species.
de: Bitte gib eine Spezies an.

# errorNoMoves
source: Please provide at least one move.
de: Bitte gib mindestens eine Attacke an.

# errorLoadingTeams
source: Something went wrong while loading your teams.
de: Es gab ein Problem beim Laden deiner Teams.

# errorDeletingTeam
source: Something went wrong while deleting the team.
de: Es gab ein Problem beim Löschen des Teams.

# errorLoginFailed
source: Login failed.
de: Login fehlgeschlagen.

# errorRegistrationFailed
source: Registration failed.
de: Registrierung fehlgeschlagen.

# errorNoName
source: Please enter a name.
de: Bitte gib einen Namen an.

# errorSavingTeam
source: Something went wrong while saving.
de: Es gab ein Problem beim Speichern des Teams.

# errorSessionInvalid
source: Your session is invalid. Please try logging in again.
de: Die Sitzung ist abgelaufen. Bitte melde dich erneut an.

# errorNotLoggedIn
source: You are not logged in.
de: Du bist nicht angemeldet.

# errorWhileInitializing
source: Error while loading data.
de: Fehler während des Ladevorgangs.

source: Error details
de: Fehlerdetails

# successSaveTeam
source: The team has been saved.
de: Das Team wurde gespeichert.

# successLoadTeam
source: The selected team has been loaded.
de: Das gewählte Team wurde geladen.

# viewingOutdatedVersion
source: You're seeing an outdated version
de: Du siehst eine veraltete Version

# fixingOutdatedCache
source: Your browser caches this website in order to load it faster. It has cached an older version of this page, which you are seeing right now. You can fix this by hard-refreshing the page by pressing Ctrl+F5 or Ctrl+Shift+R.
de: Dein Browser speichert diese Webseite zwischen, um sie schneller anzeigen zu können. Es wurde eine inzwischen veraltete Version dieser Seite gespeichert, die dir jetzt gerade angezeigt wird. Das Problem lässt sich durch einen Hard-Refresh beheben, drücke dazu Strg+F5 oder Strg+Umschalt+R.

source: Keep using outdated version
de: Veraltete Version beibehalten
